//=============================================================================
//
// 3Dエネミークラス(enemy3D.h)
// Author : 唐﨑結斗
// 概要 : 3Dエネミー生成を行う
//
//=============================================================================
#ifndef _ENEMY3D_H_			// このマクロ定義がされてなかったら
#define _ENEMY3D_H_			// 二重インクルード防止のマクロ定義

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "model3D.h"
#include "main.h"

//=============================================================================
// 3Dエネミークラス
// Author : 唐﨑結斗
// 概要 : 3Dエネミー生成を行うクラス
//=============================================================================
class CEnemy3D : public CModel3D
{
public:
	//--------------------------------------------------------------------
	// 静的メンバ関数
	//--------------------------------------------------------------------
	static CEnemy3D *Create(const char *pName);			// 3Dエネミーの生成

	//--------------------------------------------------------------------
	// コンストラクタとデストラクタ
	//--------------------------------------------------------------------
	CEnemy3D();
	~CEnemy3D();

	//--------------------------------------------------------------------
	// メンバ変数
	//--------------------------------------------------------------------
	HRESULT Init(const char *pName);					// 初期化
	void Uninit() override;								// 終了
	void Update() override;								// 更新
	void Draw() override;								// 描画
	void Hit(int nAttack);								// ヒット
	void SetLife(int nLife) { m_nLife = nLife; }		// 体力のセッター
	void SetScore(int nScore) { m_nScore = nScore; }	// スコアのセッター

private:
	//--------------------------------------------------------------------
	// メンバ変数
	//--------------------------------------------------------------------
	int m_nLife;		// 体力
	int m_nScore;		// スコア
	int m_nCntShot;		// 弾発射までのカウント
};

#endif
