//=============================================================================
//
// ライフ(explosion2D.cpp)
// Author : 唐﨑結斗
// 概要 : ライフ生成を行う
//
//=============================================================================

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <assert.h>

#include "life.h"
#include "renderer.h"
#include "application.h"

//=============================================================================
// インスタンス生成
// Author : 唐﨑結斗
// 概要 : 2Dバレットを生成する
//=============================================================================
CLife * CLife::Create()
{
	// オブジェクトインスタンス
	CLife *pLife = nullptr;

	pLife = new CLife;

	// メモリの確保ができなかった
	assert(pLife != nullptr);

	// 数値の初期化
	pLife->Init();

	// インスタンスを返す
	return pLife;
}

//=============================================================================
// コンストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス生成時に行う処理
//=============================================================================
CLife::CLife(int nPriority) : CObject2D(nPriority)
{

}

//=============================================================================
// デストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス終了時に行う処理
//=============================================================================
CLife::~CLife()
{

}

//=============================================================================
// 初期化
// Author : 唐﨑結斗
// 概要 : テクスチャの設定し、メンバ変数の初期値を設定
//=============================================================================
HRESULT CLife::Init()
{// オブジェクト2Dの初期化
	CObject2D::Init();

	// テクスチャの設定
	LoadTex(7);

	// テクスチャ座標の設定
	SetTex(D3DXVECTOR2(0.0f, 0.0f), D3DXVECTOR2(1.0f, 1.0f));

	// サイズの設定
	SetSize(D3DXVECTOR3(50.0f, 50.0f, 0.0f));

	// 状態の設定
	SetLifeState(STATE_NORMAL);

	return S_OK;
}

//=============================================================================
// 終了
// Author : 唐﨑結斗
// 概要 : テクスチャのポインタと頂点バッファの解放
//=============================================================================
void CLife::Uninit()
{// オブジェクト2Dの終了
	CObject2D::Uninit();
}

//=============================================================================
// 更新
// Author : 唐﨑結斗
// 概要 : 2D更新を行う
//=============================================================================
void CLife::Update()
{// オブジェクト2Dの更新
	CObject2D::Update();
}

//=============================================================================
// 描画
// Author : 唐﨑結斗
// 概要 : 2D描画を行う
//=============================================================================
void CLife::Draw()
{// プレイヤー2Dの描画
	CObject2D::Draw();
}

//=============================================================================
// ライフの状態の設定
// Author : 唐﨑結斗
// 概要 : ライフの状態の設定
//=============================================================================
void CLife::SetLifeState(LIFE_STATE lifeState)
{
	m_lifeState = lifeState;

	switch (m_lifeState)
	{
	case CLife::STATE_NORMAL:
		SetCol(D3DXCOLOR(1.0f, 0.0f, 0.0f, 1.0f));
		break;

	case CLife::STATE_INVALID:
		SetCol(D3DXCOLOR(0.5f, 0.0f, 0.0f, 0.5f));
		break;

	case CLife::STATE_ADDITION:
		SetCol(D3DXCOLOR(0.0f, 0.8f, 1.0f, 1.0f));
		break;

	default:
		assert(false);
		break;
	}
}
