//=============================================================================
//
// 3Dモーションプレイヤークラス(motion_player3D.h)
// Author : 唐﨑結斗
// 概要 : 3Dモーションプレイヤー生成を行う
//
//=============================================================================
#ifndef _MOTION_PLAYER3D_H_			// このマクロ定義がされてなかったら
#define _MOTION_PLAYER3D_H_			// 二重インクルード防止のマクロ定義

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "motion_char3D.h"
#include "main.h"

//=============================================================================
// 3Dモーションプレイヤークラス
// Author : 唐﨑結斗
// 概要 : 3Dモーションプレイヤー生成を行うクラス
//=============================================================================
class CMotionPlayer3D : public CMotionChar3D
{
public:
	//=============================================================================
	// モーションのタイプ列挙型
	// Author : 唐﨑結斗
	// 概要 : モーションの種別
	//=============================================================================
	enum MOTION_TYPE
	{
		TYPE_NEUTRAL = 0,			// ニュートラルモーション
		TYPE_MOVE,					// 移動モーション
		MAX_MOTION_TYPE,			// タイプの最大数
	};

	//--------------------------------------------------------------------
	// 静的メンバ関数
	//--------------------------------------------------------------------
	static CMotionPlayer3D *Create(char *pMotionName);			// 3Dモーションプレイヤーの生成

	//--------------------------------------------------------------------
	// コンストラクタとデストラクタ
	//--------------------------------------------------------------------
	CMotionPlayer3D();
	~CMotionPlayer3D();

	//--------------------------------------------------------------------
	// オーバーライド関数
	//--------------------------------------------------------------------
	HRESULT Init(char *pMotionName) override;	// 初期化
	void Uninit() override;						// 終了
	void Update() override;						// 更新
	void Draw() override;						// 描画
	
private:
	//--------------------------------------------------------------------
	// メンバ変数
	//--------------------------------------------------------------------
	MOTION_TYPE motionType;						// モーションタイプ
};

#endif