//=============================================================================
//
// タイトルクラス(title.cpp)
// Author : 唐﨑結斗
// 概要 : タイトルクラスの管理を行う
//
//=============================================================================

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <assert.h>

#include "title.h"
#include "application.h"
#include "keyboard.h"
#include "object2D.h"
#include "bg.h"

//=============================================================================
// コンストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス生成時に行う処理
//=============================================================================
CTitle::CTitle()
{
	m_pTitleLogo = nullptr;				// タイトルロゴオブジェクト
	m_pPressEnter = nullptr;			// プレスエンターオブジェクト
	m_nCntFrame = 0;					// フレームカウント
	m_bPressEnter = true;				// エンターキーを押せるか
}

//=============================================================================
// デストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス終了時に行う処理
//=============================================================================
CTitle::~CTitle()
{

}

//=============================================================================
// 初期化
// Author : 唐﨑結斗
// 概要 : 頂点バッファを生成し、メンバ変数の初期値を設定
//=============================================================================
HRESULT CTitle::Init()
{
	m_pTitleLogo = CObject2D::Create();
	m_pTitleLogo->SetPos(D3DXVECTOR3(640.0f, 300.0f, 0.0f));
	m_pTitleLogo->SetSize(D3DXVECTOR3(200.0f, 400.0f, 0.0f));
	m_pTitleLogo->SetCol(D3DXCOLOR(0.25f, 0.1f, 0.8f, 1.0f));
	m_pTitleLogo->LoadTex(16);

	m_pPressEnter = CObject2D::Create();
	m_pPressEnter->SetPos(D3DXVECTOR3(640.0f, 580.0f, 0.0f));
	m_pPressEnter->SetSize(D3DXVECTOR3(400.0f, 80.0f, 0.0f));
	m_pPressEnter->SetCol(D3DXCOLOR(0.25f, 0.1f, 0.8f, 1.0f));
	m_pPressEnter->LoadTex(15);
	
	CBG *pBG = CBG::Create();
	pBG->SetCol(D3DXCOLOR(1.0f, 1.0f, 1.0f, 0.5f));
	return S_OK;
}

//=============================================================================
// 終了
// Author : 唐﨑結斗
// 概要 : テクスチャのポインタと頂点バッファの解放
//=============================================================================
void CTitle::Uninit()
{
	// スコアの解放
	Release();
}

//=============================================================================
// 更新
// Author : 唐﨑結斗
// 概要 : 更新を行う
//=============================================================================
void CTitle::Update()
{
	// 入力情報の取得
	CKeyboard *pKeyboard = CApplication::GetKeyboard();

	FlashPE();

	if (m_bPressEnter
		&& pKeyboard->GetTrigger(DIK_RETURN))
	{
		m_bPressEnter = false;
	}

	if (m_nCntFrame >= 40)
	{
		CApplication::SetNextMode(CApplication::MODE_GAME);
	}
}

//=============================================================================
// 描画
// Author : 唐﨑結斗
// 概要 : 描画を行う
//=============================================================================
void CTitle::Draw()
{

}

//=============================================================================
// プレスエンターの点滅処理
// Author : 唐﨑結斗
// 概要 : プレスエンターの点滅させる
//=============================================================================
void CTitle::FlashPE()
{
	if (m_bPressEnter)
	{
		m_fFrame += 0.07f;
	}
	else if (!m_bPressEnter)
	{
		m_fFrame += 0.5f;
		m_nCntFrame++;
	}
	
	m_pPressEnter->SetCol(D3DXCOLOR(0.25f, 0.1f, 0.8f, sinf(m_fFrame) * 3.0f));
}
